#Merging & Joining Data

Pandas lets you combine them just like SQL â€” or even more flexibly!

In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({"EmID":[1,2,3],
                         "Name":["Alice","Ajinkya","Bob"],
                         "DeptID":[10,20,30]})

In [3]:
departments = pd.DataFrame({"DeptID":[10,20,40],
                           "DeptName":["HR","Engineering","Marketing"]})

In [4]:
employees

   EmID     Name  DeptID
0     1    Alice      10
1     2  Ajinkya      20
2     3      Bob      30

In [5]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

#Merge Like SQL: pd.merge()

In [13]:
#Inner Join (default)(commen deptid)
pd.merge(employees, departments, on="DeptID")

   EmID     Name  DeptID     DeptName
0     1    Alice      10           HR
1     2  Ajinkya      20  Engineering

In [14]:
#Left Join Keeps all employees, fills NaN where no match.
pd.merge(employees, departments, on="DeptID", how="left")

   EmID     Name  DeptID     DeptName
0     1    Alice      10           HR
1     2  Ajinkya      20  Engineering
2     3      Bob      30          NaN

In [16]:
#Right Join Keeps all departments, even if no employee.
pd.merge(employees, departments, on="DeptID", how="right")

   EmID     Name  DeptID     DeptName
0   1.0    Alice      10           HR
1   2.0  Ajinkya      20  Engineering
2   NaN      NaN      40    Marketing

In [17]:
#Outer Join Includes all data, fills missing with NaN.
pd.merge(employees, departments, on="DeptID", how="outer")

   EmID     Name  DeptID     DeptName
0   1.0    Alice      10           HR
1   2.0  Ajinkya      20  Engineering
2   3.0      Bob      30          NaN
3   NaN      NaN      40    Marketing

#Concatenating DataFrames

Use pd.concat() to stack datasets either vertically or horizontally.

In [24]:
#Vertical (rows)
df1 = pd.DataFrame({"Name":["Alice","Ajinkya"]})
df2 = pd.DataFrame({"Name":["Charlie","David"]})

pd.concat([df1,df2])

      Name
0    Alice
1  Ajinkya
0  Charlie
1    David

In [20]:
#Horizontal (columns)
df3 = pd.DataFrame({"ID":[1,2]})
df4 = pd.DataFrame({"Score":[90,89]})

pd.concat([df3,df4], axis=1)

   ID  Score
0   1     90
1   2     89

In [21]:
pd.concat([df1,df2], axis=1)

      Name     Name
0    Alice  Charlie
1  Ajinkya    David

In [22]:
pd.concat([df3,df4])

    ID  Score
0  1.0    NaN
1  2.0    NaN
0  NaN   90.0
1  NaN   89.0